In [30]:
import pandas as pd
mark = pd.read_csv("C:\\Users\\olive\\Ciencia de datos\\MarketingDirecto.csv", sep= ",")

In [31]:
from collections import defaultdict
from sklearn.preprocessing import LabelEncoder
import numpy as np

In [32]:
d = defaultdict(LabelEncoder)

In [33]:
mark.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Edad       1000 non-null   object
 1   Genero     1000 non-null   object
 2   Vivienda   1000 non-null   object
 3   Ecivil     1000 non-null   object
 4   Ubicacion  1000 non-null   object
 5   Salario    1000 non-null   int64
 6   Hijos      1000 non-null   int64
 7   Historial  697 non-null    object
 8   Catalogos  1000 non-null   int64
 9   Monto      1000 non-null   int64
dtypes: int64(4), object(6)
memory usage: 78.2+ KB

In [36]:
mark.head()

,Edad,Genero,Vivienda,Ecivil,Ubicacion,Salario,Hijos,Historial,Catalogos,Monto
0,Adulta,Femenino,Propia,Soltero,Lejos,47500,0,Alto,6,755
1,Media,Masculino,Alquilada,Soltero,Cerca,63600,0,Alto,6,1318
2,Joven,Femenino,Alquilada,Soltero,Cerca,13500,0,Bajo,18,296
3,Media,Masculino,Propia,Casado,Cerca,85600,1,Alto,18,2436
4,Media,Femenino,Propia,Soltero,Cerca,68400,0,Alto,12,1304

In [28]:
objeto_list = list(mark.columns.to_series().groupby(mark.dtypes).groups[np.dtype("object")])

In [29]:
print(objeto_list)

['Edad', 'Genero', 'Vivienda', 'Ecivil', 'Ubicacion', 'Historial']

In [41]:
objeto_list = list(mark.columns.to_series())

In [42]:
print(objeto_list)

['Edad', 'Genero', 'Vivienda', 'Ecivil', 'Ubicacion', 'Salario', 'Hijos', 'Historial', 'Catalogos', 'Monto']